openfoam/OpenFOAM-dev/tutorials/multiRegion/CHT/notchedRoller/constant/roller/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/roller";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType  constSolidThermo;

rho
{
    type        uniform;
    value       8940;
}

Cv
{
    type        uniform;
    value       385;
}

kappa
{
    type        uniform;
    value       380;
}

// ************************************************************************* //
