openfoam/OpenFOAM-dev/tutorials/multiRegion/CHT/notchedRoller/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "blockMeshDict"

actions
(
    {
        action  new;
        type    cellSet;
        name    rotating;
        source  cylinderToCell;
        point1  (0 0 -1);
        point2  (0 0 1);
        radius  #calc "$<scalar>convertToMeters * $<scalar>R";
    }
    {
        action  new;
        type    cellZoneSet;
        name    rotating;
        source  setToCellZone;
        set     rotating;
    }
);

// ************************************************************************* //
